docs: align architecture diagram
